In [1]:
import numpy as np
import pandas as pd
from sklearn import linear_model
import matplotlib.pyplot as plt
from word2number import w2n

In [2]:
df=pd.read_csv('hiring.csv')

In [3]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
df = df.replace(np.nan, 'zero', regex=True)

In [5]:
df

  experience test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                   8.0                           9      50000
1       zero                   8.0                           6      45000
2       five                   6.0                           7      60000
3        two                  10.0                          10      65000
4      seven                   9.0                           6      70000
5      three                   7.0                          10      62000
6        ten                  zero                           7      72000
7     eleven                   7.0                           8      80000

In [6]:
df.experience = df.experience.apply(w2n.word_to_num)

In [7]:
df

   experience test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                   8.0                           9      50000
1           0                   8.0                           6      45000
2           5                   6.0                           7      60000
3           2                  10.0                          10      65000
4           7                   9.0                           6      70000
5           3                   7.0                          10      62000
6          10                  zero                           7      72000
7          11                   7.0                           8      80000

In [8]:
df=df.replace('zero',0)

In [9]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    0.0                           7      72000
7          11                    7.0                           8      80000

In [10]:
import math as mt
m=mt.floor(df["test_score(out of 10)"].median())

In [11]:
m

7

In [12]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    0.0                           7      72000
7          11                    7.0                           8      80000

In [13]:
df["test_score(out of 10)"]=df["test_score(out of 10)"].replace(0,m)

In [14]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [15]:
reg=linear_model.LinearRegression()

In [16]:
reg.fit(df[['experience','test_score(out of 10)','interview_score(out of 10)']],df['salary($)'])

LinearRegression()

In [17]:
reg.predict([[12,10,10]])

array([93747.79628651])

In [18]:
import pickle

In [22]:
with open('reg_pickle','wb') as r:  
    pickle.dump(reg,r)
    ## reg-> name of model given by user, wb-> write binary , dump->save

In [26]:
with open('reg_pickle','rb') as r:
    m=pickle.load(r)

In [27]:
m.predict([[12,10,10]])

array([93747.79628651])